lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_can.c
    status = (status!=0)?SET:RESET;
    return status;
}

/*!
 * @brief     Clears the can's interrupt flag.
 *
 * @param     can: Select the CAN peripheral.
 *
 * @param     flag: Interrupt pending bit to clear
 *                  This parameter can be one of the following values:
 *                  @arg CAN_INT_TXME   : Transmit mailbox empty Interrupt
 *                  @arg CAN_INT_F0FULL : FIFO 0 full Interrupt
 *                  @arg CAN_INT_F0OVR  : FIFO 0 overrun Interrupt
 *                  @arg CAN_INT_F1FULL : FIFO 1 full Interrupt
 *                  @arg CAN_INT_F1OVR  : FIFO 1 overrun Interrupt
 *                  @arg CAN_INT_ERRW   : Error warning Interrupt
 *                  @arg CAN_INT_ERRP   : Error passive Interrupt
 *                  @arg CAN_INT_BOF    : Bus-off Interrupt
 *                  @arg CAN_INT_LEC    : Last error record code Interrupt
 *                  @arg CAN_INT_ERR    : Error Interrupt
 *                  @arg CAN_INT_WUP    : Wake-up Interrupt
 *                  @arg CAN_INT_SLEEP  : Sleep acknowledge Interrupt
 *
 * @retval    None
 */
void CAN_ClearIntFlag(CAN_T* can, CAN_INT_T flag)
{
    switch (flag)
    {
        case CAN_INT_TXME:
            can->TXSTS_B.REQCFLG0 = BIT_SET;
            can->TXSTS_B.REQCFLG1 = BIT_SET;
            can->TXSTS_B.REQCFLG2 = BIT_SET;
            break;
        case CAN_INT_F0FULL:
            can->RXF0_B.FFULLFLG0 = BIT_SET;
            break;
        case CAN_INT_F0OVR:
            can->RXF0_B.FOVRFLG0  = BIT_SET;
            break;
        case CAN_INT_F1FULL:
            can->RXF1_B.FFULLFLG1 = BIT_SET;
            break;
        case CAN_INT_F1OVR:
            can->RXF1_B.FOVRFLG1  = BIT_SET;
            break;
        case CAN_INT_WUP:
            can->MSTS_B.WUPIFLG   = BIT_SET;
            break;
        case CAN_INT_SLEEP:
            can->MSTS_B.SLEEPIFLG = BIT_SET;
            break;
        case CAN_INT_ERRW:
            can->MSTS_B.ERRIFLG = BIT_SET;
            break;
        case CAN_INT_ERRP:
            can->MSTS_B.ERRIFLG = BIT_SET;
            break;
        case CAN_INT_BOF:
            can->MSTS_B.ERRIFLG = BIT_SET;
            break;
        case CAN_INT_LEC:
            can->ERRSTS_B.LERRC = BIT_RESET;
            can->MSTS_B.ERRIFLG = BIT_SET;
            break;
        case CAN_INT_ERR:
            can->ERRSTS_B.LERRC = BIT_RESET;
            can->MSTS_B.ERRIFLG = BIT_SET;
            break;
        default:
            break;
    }
}

/**@} end of group CAN_Functions */
/**@} end of group CAN_Driver */
/**@} end of group APM32F402_403_StdPeriphDriver */
